Revit 2027 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeDocumentCorruption Property
 Cannot create a DirectShape or DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateDirectShapeOrTypeDocumentCorruption { get; }
Public Shared ReadOnly Property CannotCreateDirectShapeOrTypeDocumentCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateDirectShapeOrTypeDocumentCorruption {
	FailureDefinitionId^ get ();
}
static member CannotCreateDirectShapeOrTypeDocumentCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace